<a href="https://colab.research.google.com/github/2303a51852/Python-for-DataScience/blob/main/1_09.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [4]:
#creating pandas as pd
import pandas as pd
data=[10,20,30,40,50]
series=pd.Series(data)
print("Pandas Series:")
print(series)

Pandas Series:
0    10
1    20
2    30
3    40
4    50
dtype: int64

In [5]:
import pandas as pd
data=[10,20,30,40,50]
index_labels=['a','b','c','d','e']
series=pd.Series(data,index=index_labels)
print(series)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [14]:
from __future__ import print_function
import pandas as pd
data={
    'Name':['Alice','Bob','Charlie','David'],
    'Age':[25,30,35,40],
    'City':['Hyderabad','Delhi','Chennai','Mumbai']
}
df=pd.DataFrame(data)
print("Pandas Dataframe:")
print(df)
#accessing a single column
print(df['Name'])
#accessing multiple column
print(df[['Name','City']])
#accessing row using index
print(df.iloc[1]) #row at index 1
print(df.iloc[2]) #row with label 2

#adding new column
df['Salary']=[40000,50000,60000,70000]
print(df)

#removing a column
df=df.drop('City',axis=1)
print(df)
print(df[df['Age']>30])
print(df['Age'].mean())
print(df['Age'].max())
print(df['Age'].min())

Pandas Dataframe:
      Name  Age       City
0    Alice   25  Hyderabad
1      Bob   30      Delhi
2  Charlie   35    Chennai
3    David   40     Mumbai
0      Alice
1        Bob
2    Charlie
3      David
Name: Name, dtype: object
      Name       City
0    Alice  Hyderabad
1      Bob      Delhi
2  Charlie    Chennai
3    David     Mumbai
Name      Bob
Age        30
City    Delhi
Name: 1, dtype: object
Name    Charlie
Age          35
City    Chennai
Name: 2, dtype: object
      Name  Age       City  Salary
0    Alice   25  Hyderabad   40000
1      Bob   30      Delhi   50000
2  Charlie   35    Chennai   60000
3    David   40     Mumbai   70000
      Name  Age  Salary
0    Alice   25   40000
1      Bob   30   50000
2  Charlie   35   60000
3    David   40   70000
      Name  Age  Salary
2  Charlie   35   60000
3    David   40   70000
32.5
40
25

In [16]:
import pandas as pd
student_data={
    'student_ID':[101,102,103,104],
    'Name':['Ravi','Neha','Kiran','Sita'],
    'Marks':[85,90,78,92],
    'Department':['CSE','ECE','MECH','CSE']
}
df=pd.DataFrame(student_data)
print("Student Data:")
print(df)
print("\nStudents with Marks>80:")
print(df[df['Marks']>80])

Student Data:
   student_ID   Name  Marks Department
0         101   Ravi     85        CSE
1         102   Neha     90        ECE
2         103  Kiran     78       MECH
3         104   Sita     92        CSE

Students with Marks>80:
   student_ID  Name  Marks Department
0         101  Ravi     85        CSE
1         102  Neha     90        ECE
3         104  Sita     92        CSE

In [19]:
#student data in excelsheet with 5 records
student_data={'student_ID':[101,102,103,104,105],'Name':['ravi','raju','ram','chintu','raghu'],'M1':[80,85,90,97,95],'M2':[40,45,50,55,60],'M3':[60,65,70,75,80]}

student_data['Total'] = [m1 + m2 + m3 for m1, m2, m3 in zip(student_data['M1'], student_data['M2'], student_data['M3'])]
student_data['Avg'] = [(m1 + m2 + m3) / 3 for m1, m2, m3 in zip(student_data['M1'], student_data['M2'], student_data['M3'])]
student_data['Result'] = ['Pass' if total >= 180 else 'Fail' for total in student_data['Total']] # Assuming a passing total of 180

df=pd.DataFrame(student_data)
print(df)

   student_ID    Name  M1  M2  M3  Total        Avg Result
0         101    ravi  80  40  60    180  60.000000   Pass
1         102    raju  85  45  65    195  65.000000   Pass
2         103     ram  90  50  70    210  70.000000   Pass
3         104  chintu  97  55  75    227  75.666667   Pass
4         105   raghu  95  60  80    235  78.333333   Pass

In [21]:
import pandas as pd
import numpy as np
data={
    'Name':['Ravi','Neha,','Kiran','Sita'],
    'Age':[25,np.nan,30,28],
    'Marks':[85,90,np.nan,92]
}
df=pd.DataFrame(data)
print("Original DataFrame:")
print(df)
print("\nCheck for Missing Values")
print(df.isnull())
#drop rows with missing values
df_dropped=df.dropna()
print("After Dropping Rows with Nan:")
print(df_dropped)

Original DataFrame:
    Name   Age  Marks
0   Ravi  25.0   85.0
1  Neha,   NaN   90.0
2  Kiran  30.0    NaN
3   Sita  28.0   92.0

Check for Missing Values
    Name    Age  Marks
0  False  False  False
1  False   True  False
2  False  False   True
3  False  False  False
After Dropping Rows with Nan:
   Name   Age  Marks
0  Ravi  25.0   85.0
3  Sita  28.0   92.0

In [24]:
#fill missing values with constant
df_filled=df.fillna(0)
print("Filling with 0:")
print(df_filled)

Filling with 0:
    Name   Age  Marks
0   Ravi  25.0   85.0
1  Neha,   0.0   90.0
2  Kiran  30.0    0.0
3   Sita  28.0   92.0

In [26]:
#fill missing with mean of column
df['Age'] = df['Age'].fillna(df['Age'].mean())
df['Marks'] = df['Marks'].fillna(df['Marks'].mean())
print(df)

    Name        Age  Marks
0   Ravi  25.000000   85.0
1  Neha,  27.666667   90.0
2  Kiran  30.000000   89.0
3   Sita  28.000000   92.0

In [32]:
import pandas as pd
data={
    'ID':[1,2,3,4,5,6],
    'Name':['Ravi','Neha','Neha','Kiran','Sita','Sita'],
    'Marks':[85,90,90,78,92,92]
}
df=pd.DataFrame(data)
print("Original DataFrame with Duplicates:")
print(df)
df_no_dup=df.drop_duplicates(subset=['Name','Marks'])
print("After Removing Duplicates:")
print(df_no_dup)

Original DataFrame with Duplicates:
   ID   Name  Marks
0   1   Ravi     85
1   2   Neha     90
2   3   Neha     90
3   4  Kiran     78
4   5   Sita     92
5   6   Sita     92
After Removing Duplicates:
   ID   Name  Marks
0   1   Ravi     85
1   2   Neha     90
3   4  Kiran     78
4   5   Sita     92

In [36]:
#changing data types
data={
'ID':['1','2','3','4'],
'Marks':['85','90','78','92']
}
df=pd.DataFrame(data)
print("Original DataFrame:")
print(df.dtypes)
df['ID']=pd.to_numeric(df['ID'])
df['Marks']=pd.to_numeric(df['Marks'])
print("\nAfter Conversion:")
print(df.dtypes)

Original DataFrame:
ID       object
Marks    object
dtype: object

After Conversion:
ID       int64
Marks    int64
dtype: object

In [39]:
#applying function
df['Marks']=df['Marks'].apply(lambda x:x+7)
print("after Adding Bonus Marks")
print(df)

after Adding Bonus Marks
   ID  Marks
0   1     97
1   2    102
2   3     90
3   4    104

In [41]:
#Normalization(Scaling btw 0 & 1)
df['Marks_Normalized']=(df['Marks']-(df['Marks'].min()))/((df['Marks'].max())-df['Marks'].min())
print(df)

   ID  Marks  Marks_Normalized
0   1     97          0.500000
1   2    102          0.857143
2   3     90          0.000000
3   4    104          1.000000